pivleonid/UNO12_works/command_unit/src/device/stm32f4xx_gpio_brd.c
/*!  \file 	cpld_bus.c
 *   \brief  
 *   \details  
 *
 *
 *
 */

/*includes==========================================================================================================*/
#include "stm32f4xx_gpio_brd.h"
#include "ad9116.h"
#include <stm32f4xx_hal.h>

/*defines===========================================================================================================*/

/*types=============================================================================================================*/

/*prototypes========================================================================================================*/
void gpio_port_write(GPIO_TypeDef*  GPIOx, uint16_t value);

/*variables=========================================================================================================*/
static SPI_HandleTypeDef	handle_spi;
static	int					dac_parbus_flags;
static	int					dac_working_flags;
struct _CLKIO {
	uint8_t	clkio01:1;
	uint8_t	clkio23:1;
	uint8_t	clkio45:1;
	uint8_t	clkio67:1;
}; 
static union {
	uint8_t			byte;
	struct _CLKIO	bits;
}clkio = { 0xFF };
	
/*code==============================================================================================================*/
/*=============================================================================================================*/
/*!  \brief 

     \return int
*/
/*=============================================================================================================*/
void gpio_port_write(GPIO_TypeDef*  GPIOx, uint16_t value)
{
	GPIOx->ODR = value;	
}

	
	
/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int gpio_dac_open
	( 
	int			dac_index		/*!< [in]  определяет индекс микросхемы ЦАП БУ	DAC_01..DAC67							*/
	)
	{
	    GPIO_InitTypeDef    GPIO_InitStructure;    

		
		if (!(RCC->AHB1ENR & RCC_AHB1ENR_GPIOBEN))
		{
			__GPIOB_CLK_ENABLE();		    
		}
		/* включаем в любом случае так как на порту стробы данных */
		__GPIOE_CLK_ENABLE();
		__GPIOC_CLK_ENABLE();
		__GPIOG_CLK_ENABLE();
		
		GPIO_InitStructure.Pin = DAC_CLK_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Alternate = 0;
		HAL_GPIO_Init(DAC_CLK_GPIO_Port, &GPIO_InitStructure);
		HAL_GPIO_WritePin(DAC_CLK_GPIO_Port, DAC_CLK_Pin, GPIO_PIN_SET);
				
		GPIO_InitStructure.Pin = DAC_SPI_SS0_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(DAC_SPI_SS0_GPIO_Port, &GPIO_InitStructure);
			
		GPIO_InitStructure.Pin =  DAC_SPI_SS1_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(DAC_SPI_SS1_GPIO_Port, &GPIO_InitStructure);        

		GPIO_InitStructure.Pin = DAC_SPI_SS2_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(DAC_SPI_SS2_GPIO_Port, &GPIO_InitStructure);
			
		GPIO_InitStructure.Pin = DAC_SPI_SS3_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(DAC_SPI_SS3_GPIO_Port, &GPIO_InitStructure);        			
			
		HAL_GPIO_WritePin(DAC_SPI_SS0_GPIO_Port, DAC_SPI_SS0_Pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(DAC_SPI_SS1_GPIO_Port, DAC_SPI_SS1_Pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(DAC_SPI_SS2_GPIO_Port, DAC_SPI_SS2_Pin, GPIO_PIN_SET);			
		HAL_GPIO_WritePin(DAC_SPI_SS3_GPIO_Port, DAC_SPI_SS3_Pin, GPIO_PIN_SET);
			
		/* включаем парраллельные шины */	
		GPIO_InitStructure.Pin =    GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
									GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
									GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(GPIOE, &GPIO_InitStructure);        
		
		GPIO_InitStructure.Pin =    GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
									GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
									GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
		
		GPIO_InitStructure.Pin =    GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
									GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
									GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);            
		
		/* устанавливаем состояние high */
		gpio_port_write(GPIOE, 0x800);
		gpio_port_write(GPIOC, 0x800);
		gpio_port_write(GPIOG, 0x800);
				
		GPIO_InitStructure.Pin = DAC_CLK_IO_0_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(DAC_CLK_IO_0_GPIO_Port, &GPIO_InitStructure);        				
		
		GPIO_InitStructure.Pin = DAC_CLK_IO_3_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(DAC_CLK_IO_3_GPIO_Port, &GPIO_InitStructure);        
		
		GPIO_InitStructure.Pin =  DAC_CLK_IO_1_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(DAC_CLK_IO_1_GPIO_Port, &GPIO_InitStructure);        
		
		GPIO_InitStructure.Pin = DAC_CLK_IO_2_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(DAC_CLK_IO_2_GPIO_Port, &GPIO_InitStructure);        
		
