pivleonid/UNO12_works/command_unit/src/device/stm32f4xx_gpio_brd.c
		HAL_GPIO_WritePin(DAC_CLK_IO_0_GPIO_Port, DAC_CLK_IO_0_Pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(DAC_CLK_IO_1_GPIO_Port, DAC_CLK_IO_1_Pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(DAC_CLK_IO_2_GPIO_Port, DAC_CLK_IO_2_Pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(DAC_CLK_IO_3_GPIO_Port, DAC_CLK_IO_3_Pin, GPIO_PIN_SET);
		clkio.byte = 0x0F;
				
		/* включаем dac_reset и ставим низкий уровень */
		GPIO_InitStructure.Pin = DAC_RES_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(DAC_RES_GPIO_Port, &GPIO_InitStructure);        
		HAL_GPIO_WritePin(DAC_RES_GPIO_Port, DAC_RES_Pin, GPIO_PIN_RESET);			
		HAL_Delay(100);
		HAL_GPIO_WritePin(DAC_RES_GPIO_Port, DAC_RES_Pin, GPIO_PIN_SET);
		HAL_Delay(100);
		HAL_GPIO_WritePin(DAC_RES_GPIO_Port, DAC_RES_Pin, GPIO_PIN_RESET);			
		
		/* spi mode.... */		
		
		return OK;
    }

/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int gpio_dac_close
	( 
	int			dac_index		/*!< [in]  определяет индекс микросхемы ЦАП БУ	DAC_01..DAC67							*/
	)
    {
        GPIO_InitTypeDef    GPIO_InitStructure;
	    
	    dac_parbus_flags &= ~dac_index;
		    
	    if ((dac_index & DAC_01) || (dac_index & DAC_67))
	    {
	    	/* включаем парраллельную шину */	
		    GPIO_InitStructure.Pin =  GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
		                              GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
		                              GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11;
		    GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
		    GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		    GPIO_InitStructure.Pull = GPIO_NOPULL;
		    HAL_GPIO_Init(GPIOE, &GPIO_InitStructure);        
		    
			/* включаем CS и CLKIO */
		    if (dac_index & DAC_01)
		    {								
			    GPIO_InitStructure.Pin = DAC_CLK_IO_0_Pin;
			    GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
			    GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
			    GPIO_InitStructure.Pull = GPIO_NOPULL;
			    HAL_GPIO_Init(DAC_CLK_IO_0_GPIO_Port, &GPIO_InitStructure);        				
		    }
			
		    if (dac_index & DAC_67)
		    {				
			    GPIO_InitStructure.Pin = DAC_CLK_IO_3_Pin;
			    GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
			    GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
			    GPIO_InitStructure.Pull = GPIO_NOPULL;
			    HAL_GPIO_Init(DAC_CLK_IO_3_GPIO_Port, &GPIO_InitStructure);        
		    }
			
	    }
	    if (dac_index & DAC_23)
	    {
		    GPIO_InitStructure.Pin =    GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
		                                GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
		                                GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11;
		    GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
		    GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		    GPIO_InitStructure.Pull = GPIO_NOPULL;
		    HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
		    __GPIOC_CLK_DISABLE();		    

  			/* включаем CS и CLKIO */						
		    GPIO_InitStructure.Pin =  DAC_CLK_IO_1_Pin;
		    GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
		    GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		    GPIO_InitStructure.Pull = GPIO_NOPULL;
		    HAL_GPIO_Init(DAC_CLK_IO_1_GPIO_Port, &GPIO_InitStructure);        			
	    }
	    if (dac_index & DAC_45)
	    {
		    GPIO_InitStructure.Pin =    GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
		                                GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
		                                GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11;
		    GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
		    GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		    GPIO_InitStructure.Pull = GPIO_NOPULL;
		    HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);            
		    __GPIOG_CLK_DISABLE();
		    
			
   			/* включаем CS и CLKIO */					
		    GPIO_InitStructure.Pin = DAC_CLK_IO_2_Pin;
		    GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
		    GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		    GPIO_InitStructure.Pull = GPIO_NOPULL;
		    HAL_GPIO_Init(DAC_CLK_IO_2_GPIO_Port, &GPIO_InitStructure);			
	    }
	    
		/* если все тактирующие сигналы портов GPIO выключены выключаем reset  */
	    if (dac_parbus_flags == 0)		
		{			
			GPIO_InitStructure.Pin = DAC_RES_Pin;
		    GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
		    GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		    GPIO_InitStructure.Pull = GPIO_NOPULL;
		    HAL_GPIO_Init(DAC_RES_GPIO_Port, &GPIO_InitStructure);        				
			
			GPIO_InitStructure.Pin = DAC_SPI_SS0_Pin;
			GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
			GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
			GPIO_InitStructure.Pull = GPIO_NOPULL;
			HAL_GPIO_Init(DAC_SPI_SS0_GPIO_Port, &GPIO_InitStructure);        				
			
			GPIO_InitStructure.Pin =  DAC_SPI_SS1_Pin;
			GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
			GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
			GPIO_InitStructure.Pull = GPIO_NOPULL;
			HAL_GPIO_Init(DAC_SPI_SS1_GPIO_Port, &GPIO_InitStructure);        
			
			GPIO_InitStructure.Pin = DAC_SPI_SS2_Pin;
			GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
			GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
			GPIO_InitStructure.Pull = GPIO_NOPULL;
			HAL_GPIO_Init(DAC_SPI_SS2_GPIO_Port, &GPIO_InitStructure);        
			
			GPIO_InitStructure.Pin = DAC_SPI_SS3_Pin;
			GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
			GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
			GPIO_InitStructure.Pull = GPIO_NOPULL;
			HAL_GPIO_Init(DAC_SPI_SS3_GPIO_Port, &GPIO_InitStructure);  
			
			GPIO_InitStructure.Pin = DAC_CLK_Pin;
			GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
			GPIO_InitStructure.Pull = GPIO_NOPULL;
			GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
			GPIO_InitStructure.Alternate = 0;
			HAL_GPIO_Init(DAC_CLK_GPIO_Port, &GPIO_InitStructure);
	    }

	    
	    return OK;
}


