pivleonid/UNO12_works/command_unit/src/device/stm32f4xx_gpio_brd.c
/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int gpio_dacspi_open
	( 
	int			dac_index		/*!< [in]  определяет индекс микросхемы ЦАП БУ	DAC_01..DAC67							*/
	)
{
	GPIO_InitTypeDef    GPIO_InitStructure;
    
	if (dac_working_flags == 0)
	{
		if (!(RCC->AHB1ENR & RCC_AHB1ENR_GPIOBEN))
		{
			__GPIOB_CLK_ENABLE();		    
		}		

		        /* линии данных */
		         /**SPI2 GPIO Configuration    
		            PB13     ------> SPI2_SCK
		            PB14     ------> SPI2_MISO
		            PB15     ------> SPI2_MOSI 
		   */
	//	GPIO_InitStructure.Pin =  GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
		GPIO_InitStructure.Pin =  DAC_SCK_Pin | DAC_MOSI_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
		GPIO_InitStructure.Alternate = GPIO_AF5_SPI2;
		HAL_GPIO_Init(DAC_SPI_GPIO_Port, &GPIO_InitStructure);			
		
		GPIO_InitStructure.Pin = DAC_MISO_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
		GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		HAL_GPIO_Init(DAC_SPI_GPIO_Port, &GPIO_InitStructure);        				
		
	}
	dac_working_flags |= dac_index;
	
	return OK;

    }

/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int gpio_dacspi_close
	( 
	int			dac_index		/*!< [in]  определяет индекс микросхемы ЦАП БУ	DAC_01..DAC67							*/
	)
{
        GPIO_InitTypeDef    GPIO_InitStructure;

	    dac_working_flags &= ~dac_index;

	    if (dac_working_flags == 0)
	    {	    
		/* линии данных */
		 /**SPI2 GPIO Configuration    
		    PB13     ------> SPI2_SCK
		    PB14     ------> SPI2_MISO
		    PB15     ------> SPI2_MOSI 
		 */
//		    GPIO_InitStructure.Pin =  GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
//		    GPIO_InitStructure.Pin =  DAC_SCK_Pin | DAC_MOSI_Pin;
//	        GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
//		    GPIO_InitStructure.Pull = GPIO_NOPULL;
//		    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
//		    GPIO_InitStructure.Alternate = 0;
//		    HAL_GPIO_Init(DAC_SPI_GPIO_Port, &GPIO_InitStructure);   
		    
		    /* for AD9116 pin mode */
		    GPIO_InitStructure.Pin =  DAC_SCK_Pin | DAC_MOSI_Pin;
		    GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		    GPIO_InitStructure.Pull = GPIO_NOPULL;
		    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
		    GPIO_InitStructure.Alternate = 0;
		    HAL_GPIO_Init(DAC_SPI_GPIO_Port, &GPIO_InitStructure); 
	    }
	    	    
	    return OK;
   }

/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
	int gpio_dac_pinmode
		( 
		int			dac_index		/*!< [in]  определяет индекс микросхемы ЦАП БУ	DAC_01..DAC67							*/
		)
{	
    /* SCK-> CLKMD, low */
	HAL_GPIO_WritePin(DAC_SPI_GPIO_Port, DAC_SCK_Pin, GPIO_PIN_RESET);			
	/* SDIO -> FORMAT */
	HAL_GPIO_WritePin(DAC_SPI_GPIO_Port, DAC_MOSI_Pin, GPIO_PIN_RESET);
	/* CS'S - PWRDN to low  */
	HAL_GPIO_WritePin(DAC_SPI_SS0_GPIO_Port, DAC_SPI_SS0_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(DAC_SPI_SS1_GPIO_Port, DAC_SPI_SS1_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(DAC_SPI_SS2_GPIO_Port, DAC_SPI_SS2_Pin, GPIO_PIN_RESET);			
	HAL_GPIO_WritePin(DAC_SPI_SS3_GPIO_Port, DAC_SPI_SS3_Pin, GPIO_PIN_RESET);
	/* RESET to pin mode */
	HAL_GPIO_WritePin(DAC_RES_GPIO_Port, DAC_RES_Pin, GPIO_PIN_SET);
	
	return OK;
}
	
	



/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
void gpio_dacspi_cs_down
	(
	int			dac_index		/*!< [in]  определяет индекс микросхемы ЦАП БУ	DAC_01..DAC67							*/
	)
{
	if (dac_index & DAC_01)
	{
		HAL_GPIO_WritePin(DAC_SPI_SS0_GPIO_Port, DAC_SPI_SS0_Pin, GPIO_PIN_RESET);
	}
	else
	if (dac_index & DAC_23)
	{
		HAL_GPIO_WritePin(DAC_SPI_SS1_GPIO_Port, DAC_SPI_SS1_Pin, GPIO_PIN_RESET);		
	}
	else
	if (dac_index & DAC_45)	
	{
		HAL_GPIO_WritePin(DAC_SPI_SS2_GPIO_Port, DAC_SPI_SS2_Pin, GPIO_PIN_RESET);				
	}
	else
	if (dac_index & DAC_67)	
	{
		HAL_GPIO_WritePin(DAC_SPI_SS3_GPIO_Port, DAC_SPI_SS3_Pin, GPIO_PIN_RESET);				
	}
}


/*=============================================================================================================*/
/*!  \brief 

     \sa 
*/
/*=============================================================================================================*/
void gpio_dacspi_cs_up
	(
	int			dac_index		/*!< [in]  определяет индекс микросхемы ЦАП БУ	DAC_01..DAC67							*/
	)
{
	if (dac_index & DAC_01)
	{
		HAL_GPIO_WritePin(DAC_SPI_SS0_GPIO_Port, DAC_SPI_SS0_Pin, GPIO_PIN_SET);
	}
	else
	if (dac_index & DAC_23)
	{
		HAL_GPIO_WritePin(DAC_SPI_SS1_GPIO_Port, DAC_SPI_SS1_Pin, GPIO_PIN_SET);		
	}
	else
	if (dac_index & DAC_45)	
	{
		HAL_GPIO_WritePin(DAC_SPI_SS2_GPIO_Port, DAC_SPI_SS2_Pin, GPIO_PIN_SET);				
	}
	else
	if (dac_index & DAC_67)	
	{
		HAL_GPIO_WritePin(DAC_SPI_SS3_GPIO_Port, DAC_SPI_SS3_Pin, GPIO_PIN_SET);				
	}
}


/*=============================================================================================================*/
/*!  \brief 

     \sa 
*/
/*=============================================================================================================*/
void gpio_dacspi_reset_up (void)
{
	HAL_GPIO_WritePin(DAC_RES_GPIO_Port, DAC_RES_Pin, GPIO_PIN_SET);
}

