pivleonid/UNO12_works/command_unit/src/device/stm32f4xx_gpio_brd.c
/*=============================================================================================================*/
/*!  \brief 

     \sa 
*/
/*=============================================================================================================*/
void gpio_dacspi_reset_down(void)
{
	HAL_GPIO_WritePin(DAC_RES_GPIO_Port, DAC_RES_Pin, GPIO_PIN_RESET);
}



/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int gpio_dacpwm_open(void)
{

	GPIO_InitTypeDef	GPIO_InitStruct;
	
	    /**TIM3 GPIO Configuration    
	    PB0     ------> TIM3_CH3 
	    */
	GPIO_InitStruct.Pin = DAC_CLK_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
	HAL_GPIO_Init(DAC_CLK_GPIO_Port, &GPIO_InitStruct);

	  /* USER CODE BEGIN TIM3_MspPostInit 1 */

    /* USER CODE END TIM3_MspPostInit 1 */
	return OK;
}



/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int gpio_dacpwm_close(void)
{

	GPIO_InitTypeDef	GPIO_InitStruct;
	
	    /**TIM3 GPIO Configuration    
	    PB0     ------> TIM3_CH3 
	    */
	GPIO_InitStruct.Pin = DAC_CLK_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	GPIO_InitStruct.Alternate = 0;
	HAL_GPIO_Init(DAC_CLK_GPIO_Port, &GPIO_InitStruct);

	  /* USER CODE BEGIN TIM3_MspPostInit 1 */

    /* USER CODE END TIM3_MspPostInit 1 */

	return OK;

}


/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int gpio_dac_write_01
	(
	uint16_t	data_1,
	uint16_t	data_2
	)
{	
	/* выставляем сначала data_1 */
	/* CLKIO вниз  */		
	clkio.bits.clkio01 = 0;
//		clkio.bits.clkio23 = 0;
//		clkio.bits.clkio45 = 0;
//		clkio.bits.clkio67 = 0;
//	
//	gpio_port_write(GPIOC, data_1);	
//	gpio_port_write(GPIOG, data_1);	
	gpio_port_write(GPIOE, data_1 |  (((uint16_t)clkio.byte) << 12));	
	
//	HAL_GPIO_WritePin(DAC_CLK_IO_0_GPIO_Port, DAC_CLK_IO_0_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(DAC_CLK_GPIO_Port, DAC_CLK_Pin, GPIO_PIN_RESET);		
	
	/* выставляем data_2 */
	/* CLKIO вверх  */		
	clkio.bits.clkio01 = 1;
//		clkio.bits.clkio23 = 1;
//		clkio.bits.clkio45 = 1;
//		clkio.bits.clkio67 = 1;
//	gpio_port_write(GPIOC, data_2);	
//	gpio_port_write(GPIOG, data_2);	
	gpio_port_write(GPIOE, data_2 | (((uint16_t)clkio.byte) << 12));		
	
//	HAL_GPIO_WritePin(DAC_CLK_IO_0_GPIO_Port, DAC_CLK_IO_0_Pin, GPIO_PIN_SET);	
	HAL_GPIO_WritePin(DAC_CLK_GPIO_Port, DAC_CLK_Pin, GPIO_PIN_SET);
	
	return OK;
}


/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int gpio_dac_write_23
	(
	uint16_t	data_1,
	uint16_t	data_2
	)
{
	/* выставляем сначала data_1 */
	gpio_port_write(GPIOC, data_1);	
	
	/* CLKIO вниз  */		
	clkio.bits.clkio23 = 0;
	HAL_GPIO_WritePin(DAC_CLK_IO_1_GPIO_Port, DAC_CLK_IO_1_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(DAC_CLK_GPIO_Port, DAC_CLK_Pin, GPIO_PIN_RESET);

	/* выставляем data_2 */
	gpio_port_write(GPIOC, data_2);	
	
	/* CLKIO вверх  */		
	clkio.bits.clkio23 = 1;
	HAL_GPIO_WritePin(DAC_CLK_IO_1_GPIO_Port, DAC_CLK_IO_1_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(DAC_CLK_GPIO_Port, DAC_CLK_Pin, GPIO_PIN_SET);
		
	return OK;
}


/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int gpio_dac_write_45
	(
	uint16_t	data_1,
	uint16_t	data_2
	)
{
	/* выставляем сначала data_1 */
	gpio_port_write(GPIOG, data_1 );	
	
	/* CLKIO вниз  */		
	clkio.bits.clkio45 = 0;
	HAL_GPIO_WritePin(DAC_CLK_IO_2_GPIO_Port, DAC_CLK_IO_2_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(DAC_CLK_GPIO_Port, DAC_CLK_Pin, GPIO_PIN_RESET);

	/* выставляем data_2 */
	gpio_port_write(GPIOG, data_2 );	
	
	/* CLKIO вверх  */		
	clkio.bits.clkio45 = 1;
	HAL_GPIO_WritePin(DAC_CLK_IO_2_GPIO_Port, DAC_CLK_IO_2_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(DAC_CLK_GPIO_Port, DAC_CLK_Pin, GPIO_PIN_SET);
				
	return OK;
}


/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int gpio_dac_write_67
	(
	uint16_t	data_1,
	uint16_t	data_2
	)
{
	/* выставляем сначала data_1 */
	gpio_port_write(GPIOE, data_1 | (((uint16_t)clkio.byte) << 8));	
	
	/* CLKIO вниз  */		
	clkio.bits.clkio67 = 0;
	HAL_GPIO_WritePin(DAC_CLK_IO_3_GPIO_Port, DAC_CLK_IO_3_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(DAC_CLK_GPIO_Port, DAC_CLK_Pin, GPIO_PIN_SET);

	/* выставляем data_2 */
	gpio_port_write(GPIOE, data_2 | (((uint16_t)clkio.byte) << 8));	
	
	/* CLKIO вверх  */		
	clkio.bits.clkio67 = 1;
	HAL_GPIO_WritePin(DAC_CLK_IO_3_GPIO_Port, DAC_CLK_IO_3_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(DAC_CLK_GPIO_Port, DAC_CLK_Pin, GPIO_PIN_SET);
			
	
	return OK;
}


