pivleonid/UNO12_works/command_unit/src/device/stm32f4xx_gpio_brd.c
/*=============================================================================================================*/
/*!  \brief 

     \return int
     \retval OK, ERROR
     \sa 
*/
/*=============================================================================================================*/
int gpio_dac_write_all
	(
	uint16_t	*data,
	uint16_t	len
	)
{
	/* 01 23 45 67 */
	/* выставляем сначала i */
	if ( len > 4 ) {  /* index 4-7 */
		clkio.bits.clkio45 = 0;
		gpio_port_write(GPIOG, data[4]);			
	}
	if (len > 2) {    /* index 2-8 */
		clkio.bits.clkio23 = 0;
		gpio_port_write(GPIOC, data[2]);					
	}
	if (len > 0) {	 /* index 0-8 */
		clkio.bits.clkio45 = 0;
		gpio_port_write(GPIOE, data[0] | ( ((uint16_t)clkio.byte) << 8) );
	} else	{
		return ERR;
	}
	HAL_GPIO_WritePin(DAC_CLK_GPIO_Port, DAC_CLK_Pin, GPIO_PIN_RESET);
	
	if (len > 4) {  /* index 4-7 */
		clkio.bits.clkio45 = 1;
		gpio_port_write(GPIOG, data[5]);			
	}
	if (len > 2) {    /* index 2-8 */
		clkio.bits.clkio23 = 1;
		gpio_port_write(GPIOC, data[3]);					
	}	
	{	 /* index 0-8 */
		clkio.bits.clkio45 = 1;
		gpio_port_write(GPIOE, data[1] | (((uint16_t)clkio.byte) << 8));
	}
				
	if (len > 6) {  /* index 67 */
		clkio.bits.clkio67 = 0;		
		gpio_port_write(GPIOE, data[6] | (((uint16_t)clkio.byte) << 8));					
	} else {
		clkio.bits.clkio67 = 1;		
		gpio_port_write(GPIOE, data[7] | (((uint16_t)clkio.byte) << 8));							
	}
	HAL_GPIO_WritePin(DAC_CLK_GPIO_Port, DAC_CLK_Pin, GPIO_PIN_SET);
	
	return OK;
}





